Terraform plan for __staging__
<details>
  <summary>Plan: 4 to add, 4 to change, 4 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-45FE3B85"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-45FE3B85"
      ~ value          = 270 -> 20
        # (8 unchanged attributes hidden)
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-A4707A72"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-A4707A72"
      ~ value          = 270 -> 20
        # (8 unchanged attributes hidden)
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-F678F1CE"] will be updated in-place
  ~ resource "aws_servicequotas_service_quota" "minimum_quotas" {
        id             = "vpc/L-F678F1CE"
      ~ value          = 270 -> 20
        # (8 unchanged attributes hidden)
    }

  # cloudfoundry_service_instance.k8s_cluster will be updated in-place
  ~ resource "cloudfoundry_service_instance" "k8s_cluster" {
        id                             = "85e9a5f5-31d9-4520-b2c4-a646b68c128c"
      - json_params                    = jsonencode(
            {
              - subdomain = "k8s-brokered"
            }
        ) -> null
        name                           = "ssb-solr-k8s"
        tags                           = [
            "k8s",
        ]
        # (5 unchanged attributes hidden)

      ~ timeouts {
          ~ create = "40m" -> "60m"
          ~ delete = "30m" -> "40m"
            # (1 unchanged attribute hidden)
        }
    }

  # module.assumable_admin_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:SetSourceIdentity",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::657786969144:root"
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SSBAdmin"
      + path                  = "/"
      + tags                  = {
          + "Role" = "Admin"
        }
      + tags_all              = {
          + "Role" = "Admin"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.assumable_admin_role.aws_iam_role_policy_attachment.admin[0] will be created
  + resource "aws_iam_role_policy_attachment" "admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "SSBAdmin"
    }

  # module.assumable_poweruser_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:SetSourceIdentity",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::657786969144:root"
                          + Service = []
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SSBDev"
      + path                  = "/"
      + tags                  = {
          + "Role" = "PowerUser"
        }
      + tags_all              = {
          + "Role" = "PowerUser"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.assumable_poweruser_role.aws_iam_role_policy_attachment.poweruser[0] will be created
  + resource "aws_iam_role_policy_attachment" "poweruser" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/PowerUserAccess"
      + role       = "SSBDev"
    }

  # module.iam_assumable_roles.aws_iam_role.admin[0] will be destroyed
  - resource "aws_iam_role" "admin" {
      - arn                   = "arn:aws:iam::054110281448:role/SSBAdmin" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - Bool            = {
                              - aws:MultiFactorAuthPresent = "true"
                            }
                          - NumericLessThan = {
                              - aws:MultiFactorAuthAge = "86400"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::657786969144:root"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-08-06T22:31:39Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SSBAdmin" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SSBAdmin" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQZGJZL3UHMNG2SORA" -> null

      - inline_policy {}
    }

  # module.iam_assumable_roles.aws_iam_role.poweruser[0] will be destroyed
  - resource "aws_iam_role" "poweruser" {
      - arn                   = "arn:aws:iam::054110281448:role/SSBDev" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Condition = {
                          - Bool            = {
                              - aws:MultiFactorAuthPresent = "true"
                            }
                          - NumericLessThan = {
                              - aws:MultiFactorAuthAge = "86400"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::657786969144:root"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-08-06T22:31:39Z" -> null
      - force_detach_policies = false -> null
      - id                    = "SSBDev" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/PowerUserAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "SSBDev" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQZGJZL3UPHQ7EFIHW" -> null

      - inline_policy {}
    }

  # module.iam_assumable_roles.aws_iam_role_policy_attachment.admin[0] will be destroyed
  - resource "aws_iam_role_policy_attachment" "admin" {
      - id         = "SSBAdmin-20210806223140634700000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "SSBAdmin" -> null
    }

  # module.iam_assumable_roles.aws_iam_role_policy_attachment.poweruser[0] will be destroyed
  - resource "aws_iam_role_policy_attachment" "poweruser" {
      - id         = "SSBDev-20210806223140644700000006" -> null
      - policy_arn = "arn:aws:iam::aws:policy/PowerUserAccess" -> null
      - role       = "SSBDev" -> null
    }

Plan: 4 to add, 4 to change, 4 to destroy.
```
</details>

Plan generated in [plan #117](https://github.com/GSA/datagov-ssb/actions/runs/1247579474)